Re_10000/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.96;         // [g/mol]
    }
    equationOfState
    {
        rho         1.1785;     // [kg/m^3]
    }
    thermodynamics
    {
        Cv          1.0063e3;       // [J/kg/K]
        Hf          0;
    }
    transport
    {
        mu          1.8515e-5;  // [kg/m/s]
        Pr          0.71438;
    }
}


// ************************************************************************* //
