Re_10000/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontBack
    {
        type            empty;
    }
    WALL
    {
        type            fixedFluxPressure;
		value			uniform 1e5;
    }
    OUTLET
    {
        type            fixedValue;
		value			uniform 1e5;
    }
    INLET
    {
        type            fixedFluxPressure;
		value			uniform 1e5;
    }
    PRISM
    {
        type            fixedFluxPressure;
		value			uniform 1e5;
    }
}


// ************************************************************************* //
